frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->first_name = $this->first_name;
        $user->last_name = $this->last_name;
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`username`, `first_name`, `last_name`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('PetarKralj', 'Petar', 'Petrovic', 'petar@gmail.com', '$2y$13$HMQxCwfydfKWr2SYQRdtm.pAyfdtwJHpXsNHeApLkhhawUcs46keK', 'raPrRmfa7P8Hz4xhO5leSVHPHTaD3Al1', 10, 1545683043, 1545683043)